# 3. Напишите функцию которая принимает на вход список. Функция создает из этого списка новый список из квадратных корней
# чисел (если число положительное) и самих чисел (если число отрицательное) и возвращает результат (желательно применить
# генератор и тернарный оператор при необходимости). В результате работы функции исходный список не должен измениться.
# Например:
# old_list = [1, -3, 4]
# result = [1, -3, 2]
#
#     Примечание: Список с целыми числами создайте вручную в начале файла.
# Не забудьте включить туда отрицательные числа. 10-20 чисел в списке вполне достаточно.

import random, math

my_list = [random.randint(-100, 100) for numbers in range(20)]
print(my_list)


def lister(list):
    result = [math.sqrt(number) if number > 0 else number for number in list]
    return result

print(lister(my_list))
